social_net/perf_testing/data/composePost/202404261551_3450_2m.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 3737.335ms, rate sampling interval: 14581ms
  Thread calibration: mean lat.: 3775.907ms, rate sampling interval: 14655ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.86m    22.75s    1.58m    63.13%
    Req/Sec   364.43     62.31   448.00     42.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.86m 
 75.000%    1.16m 
 90.000%    1.37m 
 99.000%    1.58m 
 99.900%    1.64m 
 99.990%    1.69m 
 99.999%    1.72m 
100.000%    1.72m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8011.775     0.000000            1         1.00
   19283.967     0.100000         7843         1.11
   30457.855     0.200000        15679         1.25
   38141.951     0.300000        23509         1.43
   44990.463     0.400000        31363         1.67
   51806.207     0.500000        39160         2.00
   55377.919     0.550000        43077         2.22
   58982.399     0.600000        46991         2.50
   62357.503     0.650000        50912         2.86
   65994.751     0.700000        54838         3.33
   69533.695     0.750000        58785         4.00
   71237.631     0.775000        60707         4.44
   73138.175     0.800000        62700         5.00
   75104.255     0.825000        64639         5.71
   77332.479     0.850000        66607         6.67
   79691.775     0.875000        68541         8.00
   81068.031     0.887500        69555         8.89
   82378.751     0.900000        70495        10.00
   83755.007     0.912500        71496        11.43
   85327.871     0.925000        72481        13.33
   86704.127     0.937500        73435        16.00
   87621.631     0.943750        73937        17.78
   88408.063     0.950000        74425        20.00
   89128.959     0.956250        74927        22.86
   90046.463     0.962500        75421        26.67
   90898.431     0.968750        75900        32.00
   91291.647     0.971875        76129        35.56
   91684.863     0.975000        76367        40.00
   92209.151     0.978125        76625        45.71
   92733.439     0.981250        76851        53.33
   93454.335     0.984375        77108        64.00
   93782.015     0.985938        77229        71.11
   94109.695     0.987500        77351        80.00
   94437.375     0.989062        77468        91.43
   94765.055     0.990625        77584       106.67
   95158.271     0.992188        77706       128.00
   95354.879     0.992969        77766       142.22
   95617.023     0.993750        77838       160.00
   95879.167     0.994531        77901       182.86
   96141.311     0.995313        77955       213.33
   96468.991     0.996094        78017       256.00
   96665.599     0.996484        78045       284.44
   96862.207     0.996875        78073       320.00
   97058.815     0.997266        78103       365.71
   97320.959     0.997656        78137       426.67
   97583.103     0.998047        78168       512.00
   97648.639     0.998242        78179       568.89
   97845.247     0.998437        78198       640.00
   97976.319     0.998633        78210       731.43
   98172.927     0.998828        78225       853.33
   98369.535     0.999023        78241      1024.00
   98500.607     0.999121        78249      1137.78
   98697.215     0.999219        78256      1280.00
   98762.751     0.999316        78263      1462.86
   98959.359     0.999414        78271      1706.67
   99155.967     0.999512        78278      2048.00
   99352.575     0.999561        78283      2275.56
   99483.647     0.999609        78287      2560.00
   99745.791     0.999658        78291      2925.71
  100007.935     0.999707        78295      3413.33
  100204.543     0.999756        78298      4096.00
  100270.079     0.999780        78299      4551.11
  100401.151     0.999805        78301      5120.00
  100597.759     0.999829        78303      5851.43
  100990.975     0.999854        78305      6826.67
  101187.583     0.999878        78307      8192.00
  101384.191     0.999890        78308      9102.22
  101515.263     0.999902        78309     10240.00
  101646.335     0.999915        78310     11702.86
  101842.943     0.999927        78311     13653.33
  102236.159     0.999939        78312     16384.00
  102236.159     0.999945        78312     18204.44
  102563.839     0.999951        78313     20480.00
  102563.839     0.999957        78313     23405.71
  102694.911     0.999963        78314     27306.67
  102694.911     0.999969        78314     32768.00
  102694.911     0.999973        78314     36408.89
  103153.663     0.999976        78315     40960.00
  103153.663     0.999979        78315     46811.43
  103153.663     0.999982        78315     54613.33
  103153.663     0.999985        78315     65536.00
  103153.663     0.999986        78315     72817.78
  103219.199     0.999988        78316     81920.00
  103219.199     1.000000        78316          inf
#[Mean    =    51559.639, StdDeviation   =    22745.220]
#[Max     =   103153.664, Total count    =        78316]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  84301 requests in 2.00m, 22.81MB read
  Non-2xx or 3xx responses: 227
Requests/sec:    702.34  
Transfer/sec:    194.63KB